package org.example.web.api;

// @RestController - стереотипная аннотация. Данная аннотация служит подсказкой для людей, читающих код, и для Spring,
// что класс играет определенную роль. В данном случае наш класс является @Controller для веб, поэтому Spring учитывает
// его при обработке входящих веб-запросов.

// @RequestMapping - аннотация передает информацию о "маршрутизации". Она сообщает Spring, что любой HTTP-запрос
// с путем / следует отображать на метод home

// Аннотации @RestController и @RequestMapping являются аннотациями Spring MVC (они не характерны для Spring Boot).
